<?php

return [
    'error' => array(
        'auth' => 'Неверный логин/пароль',
        'object_not_found' => 'Объект не найден',
        'name_required' => 'Поле «Название» обязательно для заполнения',
        'all_required' => 'Все поля обязательны для заполнения',
        'page_not_found' => 'Страница не найдена',
        'phone_not_found' => 'Запись не найдена',
        'phone_exists' => 'Такой телефон уже есть в черном списке',
        'phone_required' => 'Поле «Телефон» обязательно для заполнения',
    ),
    'district_o' => array(
        1 => '1-й п. Орджоникидзе', 
        2 => '2-й п. Орджоникидзе',
        3 => 'Александровка',
        4 => 'Берберовка',
        5 => 'Болгарстрой',
        6 => 'Военвед',
        7 => 'ЗЖМ',
        8 => 'Змиевка',
        9 => 'Каменка',
        10 => 'Левенцовский',
        11 => 'Ленгородок',
        12 => 'Мирный',
        13 => 'Мясникован',
        14 => 'Нахичевань',
        15 => 'Новое поселение',
        16 => 'Олимпиадовка',
        17 => 'Сельмаш',
        18 => 'СЖМ',
        19 => 'Стройгородок',
        20 => 'Темерник',
        21 => 'Фрунзе',
        22 => 'Чкаловский',
        23 => 'Другой'
    ),
    'district_m' => array(
        1 => 'Ворошиловский',
        2 => 'Железнодорожный',
        3 => 'Кировский',
        4 => 'Ленинский',
        5 => 'Октябрьский',
        6 => 'Первомайский',
        7 => 'Пролетарский',
        8 => 'Советский',
        9 => 'Другой'
    )
];
