window.I18n = {
    titles: {
        not_found: 'Cтраница не найдена',
        login: 'Авторизация',
        dashboard: 'Главная',
        objects: 'Объекты',
        objects_create: 'Создание объекта',
        objects_edit: 'Редактирование объекта',
        objects_view: 'Просмотр объекта',
        developers: 'Застройщики',
        developers_create: 'Добавить застройщика',
        developers_edit: 'Редактирование застройщика',
        developers_view: 'Просмотр застройщика',
        districts: 'Районы',
        districts_create: 'Добавить район',
        districts_edit: 'Редактирование района',
        districts_view: 'Просмотр района',
        complex: 'Жилищные комплексы',
        complex_create: 'Добавить комплекс',
        complex_edit: 'Редактирование комплекса',
        complex_view: 'Просмотр комплекса',
        orders: 'Заказы',
        order: 'Просмотр заказа',
        orders_view: 'Просмотр заказа',
        ads: 'Объявления',
        ads_create: 'Создание объявления',
        ads_edit: 'Редактирование объявления',
        ads_view: 'Просмотр объявления',
        pages: 'Статичные страницы',
        pages_create: 'Создание страницы',
        pages_edit: 'Редактирование страницы',
        pages_view: 'Просмотр страницы',
        banners: 'Баннеры',
        users: 'Пользователи',
        import: 'Импорт данных',
        blacklist: 'Черный список',
        blacklist_create: 'Добавление в черный список',
        blacklist_edit: 'Изменение черного списка',
        settings: 'Настройки'
    },
    h1: {
        default: 'Title',
        login: 'Авторизация',
        dashboard: 'Главная',
        objects: 'Объекты',
        objects_create: 'Создание объекта',
        orders_view: 'Просмотр заказа',
        objects_edit: 'Редактирование объекта',
        objects_view: 'Просмотр объекта',
        developers: 'Застройщики',
        developers_create: 'Добавить застройщика',
        developers_edit: 'Редактирование застройщика',
        developers_view: 'Просмотр застройщика',
        districts: 'Районы',
        districts_create: 'Добавить район',
        districts_edit: 'Редактирование района',
        districts_view: 'Просмотр района',
        complex: 'Жилищные комплексы',
        complex_create: 'Добавить комплекс',
        complex_edit: 'Редактирование комплекса',
        complex_view: 'Просмотр комплекса',
        orders: 'Заказы',
        order: 'Просмотр заказа',
        ads: 'Объявления',
        ads_create: 'Создание объявления',
        ads_edit: 'Редактирование объявления',
        ads_view: 'Просмотр объявления',
        pages: 'Статичные страницы',
        pages_create: 'Создание страницы',
        pages_edit: 'Редактирование страницы',
        pages_view: 'Просмотр страницы',
        banners: 'Баннеры',
        users: 'Пользователи',
        import: 'Импорт данных',
        blacklist: 'Черный список',
        blacklist_create: 'Добавление в черный список',
        blacklist_edit: 'Изменение черного списка',
        settings: 'Настройки'
    },
    loading: {
        default: 'Загружаем...',
        dashboard: 'Загружаем главную...',
        objects: 'Загружаем список объектов...',
        pages: 'Загружаем список статичных страниц...',
        orders: 'Загружаем список заказов...',
        banners: 'Загружаем список баннеров...',
        users: 'Загружаем список пользователей...',
        ads: 'Загружаем список объявлений...',
        settings: 'Загружаем настройки...'
    },
    text: {
        not_found_head: 'Oops! Что-то пошло не так...',
        not_found_body: 'Страница которую Вы ищите не найдена.',
        login_error: 'Введите email',
        invalid_login_error: 'Неверный формат email',
        password_error: 'Введите пароль'
    },
    buttons: {
        send: 'Send',
        login: 'Войти',
        logout: 'Выйти',
        save: 'Сохранить',
        add: 'Добавить'
    },
    buttons_process: {
        send: 'Sending...',
        login: 'Проверка...',
        load: 'Loading...',
        remove: 'Removing...',
        save: 'Сохраняем...'
    },
    placeholders: {
        login: 'Логин',
        email: 'Email',
        password: 'Пароль'
    },
    common: {
        menu: 'Меню',
        error: 'Ошибка',
        close: 'Закрыть',
        remember: 'Запомнить на этом компьютере',
        close_menu: 'Закрыть меню',
        yes: 'Да',
        no: 'Нет',
        periods: {
            today: 'Сегодня',
            week: 'Неделя',
            month: 'Месяц'
        },
        orders: ['заказ', 'заказа', 'заказов'],
        ads: ['объявление', 'объявления', 'объявлений'],
        objects: ['здание', 'здания', 'зданий'],
        districts: ['район', 'районы', 'районов'],
        users: ['пользователь', 'пользователя', 'пользователей']
    },
    object_types: {
        1: 'квартиры',
        2: 'гостинка',
        3: 'комнаты',
        4: 'ком. недвижимость'
    },
    object_materials: {
        1: 'кирпич',
        2: 'панель',
        3: 'кирпично-панельный'
    },
    object_conditions: {
        1: 'Без внутренней отделки',
        2: 'Требуется ремонт',
        3: 'Жилое',
        4: 'Хорошее',
        5: 'Отличное',
        6: 'Евроремонт'
    },
    district_o: {
        1: '1-й п. Орджоникидзе', 
        2: '2-й п. Орджоникидзе',
        3: 'Александровка',
        4: 'Берберовка',
        5: 'Болгарстрой',
        6: 'Военвед',
        7: 'ЗЖМ',
        8: 'Змиевка',
        9: 'Каменка',
        10: 'Левенцовский',
        11: 'Ленгородок',
        12: 'Мирный',
        13: 'Мясникован',
        14: 'Нахичевань',
        15: 'Новое поселение',
        16: 'Олимпиадовка',
        17: 'Сельмаш',
        18: 'СЖМ',
        19: 'Стройгородок',
        20: 'Темерник',
        21: 'Фрунзе',
        22: 'Чкаловский',
        23: 'Другой'
    },
    district_m: {
        1: 'Ворошиловский',
        2: 'Железнодорожный',
        3: 'Кировский',
        4: 'Ленинский',
        5: 'Октябрьский',
        6: 'Первомайский',
        7: 'Пролетарский',
        8: 'Советский',
        9: 'Другой'
    },
    ads_subtype: {
        0: 'изолированное',
        1: 'комната',
        2: 'гостинка',
        3: 'офис',
        4: 'торговая площадка'
    },
    ads_types: {
        1: 'жилое помещение', 
        2: 'дом', 
        3: 'участок',
        4: 'гараж',
        5: 'ком. недвиж'
    },
    ads_pltype: {
        0: 'м2', 
        1: 'сотка'
    },
    menu: [
        {title: 'Главная', href: '/', icon: 'home'},
        {title: 'Объявления', href: '/ads', icon: 'location_on'},
        {title: 'Объекты', href: '/objects', icon: 'location_city'},
        {title: 'Заказы', href: '/orders', icon: 'shopping_cart'},
        {title: 'Пользователи', href: '/users', icon: 'person'},
        {title: 'Статичные страницы', href: '/pages', icon: 'title'},
//        {title: 'Баннеры', href: '/banners', icon: 'file_upload'},
        {title: 'Черный список', href: '/blacklist', icon: 'turned_in'},
        {title: 'Импорт данных', href: '/import', icon: 'perm_media'},
        {title: 'Настройки', href: '/settings', icon: 'settings'}
    ],
    messages: {
        object: {
            success_created: 'Объект добавлен в базу',
            success_updated: 'Данные об объекте изменены',
            success_deleted: 'Объект удален'
        },
        ad: {
            success_created: 'Объявление добавлено в базу',
            success_updated: 'Объявление изменено',
            success_deleted: 'Объявление удалено'
        },
        bl_phone: {
            success_created: 'Телефон добавлен в черный список',
            success_updated: 'Черный список обновлен',
            success_deleted: 'Телефон удален из черного списка'
        },
        page: {
            success_created: 'Страница создана',
            success_updated: 'Страница изменена',
            success_deleted: 'Страница удалена'
        },
        district: {
            success_created: 'Район добавлен в базу',
            success_updated: 'Район изменен',
            success_deleted: 'Район удален'
        },
        developer: {
            success_created: 'Застройщик добавлен в базу',
            success_updated: 'Застройщик изменен',
            success_deleted: 'Застройщик удален'
        },
        complex: {
            success_created: 'Жилищный комплекс добавлен в базу',
            success_updated: 'Жилищный комплекс изменен',
            success_deleted: 'Жилищный комплекс удален'
        },
        settings: {
            saved: 'Настройки сохранены'
        }
    },
    errors: {
        internal: 'На сервере произошла ошибка. Свяжитесь с администратором сайта',
        unauthorized: 'Ваша сессия истекла. Пожалуйста авторизуйтесь заново',
        image_ext: 'Неверный формат файла. Разрешено загружать только jpg, jpeg, png.',
        max_size: 'Превышен максимальный размер загружаемого файла (2M)',
        empty_file: 'Вы не можете загрузить пустой файл',
        object: {
            no_address: 'Вы не указали адрес объекта'
        }
    },
    orders: {
        status: {
            new: 'Новый',
            viewed: 'Просмотренный',
            progress: 'В прогрессе',
            archived: 'В архиве'
        }
    },
    ads_status: {
        publish: 'Опубликовано',
        pending: 'На модерации',
        archived: 'В архиве'
    },
    districts: {
        type: {
            m: 'Муниципальный',
            o: 'Общепринятый'
        }
    },
    datepicker: {
        months: ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'],
        shortMonths: ['Янв', 'Фев', 'Мар', 'Апр', 'Май', 'Июн', 'Июл', 'Авг', 'Сен', 'Окт', 'Ноя', 'Дек'],
        days: ['понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскресенье'],
        shortDays: ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс']
    }
};